[
  { "skill": "combat", "backstory": "A former soldier who survived countless battles, scarred but unbroken, ready to defend new allies." },
  { "skill": "combat", "backstory": "Grew up fighting in the ruins, learning that strength is the only law in the wasteland." },
  { "skill": "combat", "backstory": "Once a bodyguard for a wealthy merchant, now uses those skills to protect fellow survivors." },
  { "skill": "combat", "backstory": "Fought zombies with makeshift weapons, thriving on the adrenaline of life-or-death combat." },
  { "skill": "combat", "backstory": "Ex-raider seeking redemption but still quick to draw a blade when threatened." },
  { "skill": "combat", "backstory": "Survived gang wars in the city ruins, now brings those brutal skills to the colony's defense." },
  { "skill": "combat", "backstory": "A former police officer whose badge meant nothing after the fall, but whose training never faded." },
  { "skill": "combat", "backstory": "Learned to fight in underground arenas, where only the strongest earned their next meal." },
  { "skill": "combat", "backstory": "Once a martial arts instructor, now teaches survival through superior firepower." },
  { "skill": "combat", "backstory": "Fought their way out of a raider camp, bearing scars and an unshakeable will to never be captured again." },
  { "skill": "combat", "backstory": "A former marine whose unit scattered in the chaos, but whose loyalty to comrades remained steadfast." },
  { "skill": "combat", "backstory": "Survived as a bounty hunter in lawless territories, tracking down the worst humanity had to offer." },
  { "skill": "combat", "backstory": "Defended a small settlement for years until it fell, now seeks a new home to protect." },
  { "skill": "combat", "backstory": "Trained as an assassin before the fall, now uses those deadly skills for the greater good." },
  { "skill": "combat", "backstory": "A pit fighter who earned freedom through blood and sweat, never backing down from a fight." },
  { "skill": "combat", "backstory": "Former SWAT team member whose tactical knowledge proves invaluable in coordinated defense." },
  { "skill": "combat", "backstory": "Learned warfare from raiders before turning against them, using their own tactics to hunt them." },
  { "skill": "combat", "backstory": "A boxer whose ring skills translated perfectly to wasteland brawls and zombie encounters." },
  { "skill": "combat", "backstory": "Military sniper whose patience and precision have saved countless lives from the shadows." },
  { "skill": "combat", "backstory": "Fought as a gladiator in underground circles, where losing meant death and winning meant another day." },

  { "skill": "scavenging", "backstory": "Spent years exploring ruins, developing an eye for valuable salvage hidden in the most unlikely places." },
  { "skill": "scavenging", "backstory": "A former archaeologist whose knowledge of the old world helps uncover its lost treasures." },
  { "skill": "scavenging", "backstory": "Grew up poor, learning to find worth in what others discarded—a skill invaluable in the wasteland." },
  { "skill": "scavenging", "backstory": "Once worked demolition, knows exactly where to look in collapsed buildings for the best salvage." },
  { "skill": "scavenging", "backstory": "Survived as a junk dealer, trading scraps and spare parts across the wasteland's scattered settlements." },
  { "skill": "scavenging", "backstory": "Former urban explorer who mapped the underground tunnels, knowing every secret cache in the ruins." },
  { "skill": "scavenging", "backstory": "A treasure hunter by trade and by heart, always chasing legends of pre-war vaults and bunkers." },
  { "skill": "scavenging", "backstory": "Worked in recycling plants before the fall, can identify valuable materials at a glance." },
  { "skill": "scavenging", "backstory": "Street smart from childhood, developed an instinct for finding hidden stashes and forgotten supplies." },
  { "skill": "scavenging", "backstory": "Former antique dealer with an eye for valuable old-world items that others might overlook." },
  { "skill": "scavenging", "backstory": "Learned to pick through battlefields after firefights, always first to claim the spoils of war." },
  { "skill": "scavenging", "backstory": "A pack rat by nature, hoarded useful items long before hoarding became a survival necessity." },
  { "skill": "scavenging", "backstory": "Former waste management worker who knows where the good stuff gets thrown away." },
  { "skill": "scavenging", "backstory": "Spent childhood exploring abandoned buildings, turning youthful curiosity into adult expertise." },
  { "skill": "scavenging", "backstory": "A magpie for shiny objects, but with the wisdom to know what shine actually has value." },
  { "skill": "scavenging", "backstory": "Once led scavenging parties for a large settlement, coordinating searches across dangerous territories." },
  { "skill": "scavenging", "backstory": "Former pawn shop owner who developed an eye for hidden value in broken and discarded items." },
  { "skill": "scavenging", "backstory": "Learned to live off what the city threw away, turning survival into an art form." },
  { "skill": "scavenging", "backstory": "A former maintenance worker who knows the forgotten spaces where the best supplies are hidden." },
  { "skill": "scavenging", "backstory": "Methodical and patient, approaches scavenging like archaeology—cataloging finds and mapping locations." },

  { "skill": "farming", "backstory": "Grew up on a farm before the bombs fell, still remembers the old ways of working the land." },
  { "skill": "farming", "backstory": "A botanist who specializes in growing food in contaminated soil, finding life where others see death." },
  { "skill": "farming", "backstory": "Maintained a hidden garden throughout the chaos, proving that life persists against all odds." },
  { "skill": "farming", "backstory": "Former agricultural engineer who designs irrigation systems from scraps and determination." },
  { "skill": "farming", "backstory": "Learned hydroponics in a underground bunker, mastering soil-free growing techniques." },
  { "skill": "farming", "backstory": "A seed collector who hoarded genetic diversity, dreaming of fields green with possibility." },
  { "skill": "farming", "backstory": "Worked in greenhouse complexes, understanding the delicate balance needed for sustained growth." },
  { "skill": "farming", "backstory": "Former veterinarian who adapted their knowledge to nurture both plants and small livestock." },
  { "skill": "farming", "backstory": "Grew medicinal herbs in secret, combining healing knowledge with growing expertise." },
  { "skill": "farming", "backstory": "Survived by cultivating mushrooms in dark tunnels, finding sustenance in the shadows." },
  { "skill": "farming", "backstory": "A permaculture enthusiast who sees farming as working with nature rather than against it." },
  { "skill": "farming", "backstory": "Former food scientist who understands nutrition and optimal growing conditions for maximum yield." },
  { "skill": "farming", "backstory": "Learned to grow crops in abandoned parking lots, turning concrete wastelands into productive gardens." },
  { "skill": "farming", "backstory": "A beekeeper whose knowledge of pollinators proves crucial for sustainable food production." },
  { "skill": "farming", "backstory": "Former landscaper who adapted ornamental skills to grow food in the most challenging conditions." },
  { "skill": "farming", "backstory": "Studied indigenous farming techniques, applying ancient wisdom to post-apocalyptic challenges." },
  { "skill": "farming", "backstory": "A patient gardener who believes that nurturing seeds is nurturing hope for the future." },
  { "skill": "farming", "backstory": "Worked on vertical farms in the city, maximizing yield in minimal space." },
  { "skill": "farming", "backstory": "Former ranch hand who understands both crops and livestock, bringing comprehensive agricultural knowledge." },
  { "skill": "farming", "backstory": "A soil specialist who can rehabilitate damaged earth, slowly bringing fertility back to the wasteland." },

  { "skill": "crafting", "backstory": "A master tinkerer who can turn scrap metal into useful tools with just a hammer and ingenuity." },
  { "skill": "crafting", "backstory": "Former jeweler whose precision and attention to detail now creates perfectly balanced weapons." },
  { "skill": "crafting", "backstory": "Learned carpentry from their grandfather, now builds sturdy furniture and structures from salvaged wood." },
  { "skill": "crafting", "backstory": "A sculptor whose artistic eye helps create both beautiful and functional items from unlikely materials." },
  { "skill": "crafting", "backstory": "Former factory worker who understands production processes and efficient use of limited resources." },
  { "skill": "crafting", "backstory": "An inventor at heart, always seeing new possibilities in broken things and spare parts." },
  { "skill": "crafting", "backstory": "Worked in a custom motorcycle shop, bringing metalworking skills to wasteland crafting needs." },
  { "skill": "crafting", "backstory": "Former seamstress who creates durable clothing and gear from salvaged fabric and leather." },
  { "skill": "crafting", "backstory": "A hobbyist woodworker whose weekend passion became an essential survival skill." },
  { "skill": "crafting", "backstory": "Former electronics technician who builds communication devices and useful gadgets from components." },
  { "skill": "crafting", "backstory": "Learned pottery as therapy, now creates essential containers and vessels for the community." },
  { "skill": "crafting", "backstory": "A former set designer who approaches crafting with creativity and an eye for innovative solutions." },
  { "skill": "crafting", "backstory": "Worked in a repair shop, developing skills to fix and improve almost any broken item." },
  { "skill": "crafting", "backstory": "Former tool and die maker whose precision work creates essential equipment for specialized tasks." },
  { "skill": "crafting", "backstory": "A blacksmith's apprentice who learned to shape metal with fire and force, creating lasting works." },
  { "skill": "crafting", "backstory": "Former costume designer who now creates practical gear with both function and personal flair." },
  { "skill": "crafting", "backstory": "Learned glassblowing as an art form, now creates essential containers and optical equipment." },
  { "skill": "crafting", "backstory": "A former clockmaker whose patience and precision create intricate mechanical devices." },
  { "skill": "crafting", "backstory": "Former aircraft mechanic who applies aerospace precision to creating reliable equipment." },
  { "skill": "crafting", "backstory": "A maker movement enthusiast who combined traditional techniques with modern innovation." },

  { "skill": "medical", "backstory": "A former doctor who took the Hippocratic Oath seriously, dedicating their life to healing others." },
  { "skill": "medical", "backstory": "Field medic whose battlefield experience provides invaluable trauma care knowledge." },
  { "skill": "medical", "backstory": "Former veterinarian who adapted animal care skills to treat human ailments and injuries." },
  { "skill": "medical", "backstory": "A nurse who worked in emergency rooms, accustomed to making life-or-death decisions under pressure." },
  { "skill": "medical", "backstory": "Self-taught healer who learned from medical textbooks and hard experience in the wasteland." },
  { "skill": "medical", "backstory": "Former paramedic whose quick thinking and steady hands have saved countless lives." },
  { "skill": "medical", "backstory": "A pharmacist who understands drug interactions and can create medicines from available materials." },
  { "skill": "medical", "backstory": "Former physical therapist who helps survivors recover from injuries and maintain mobility." },
  { "skill": "medical", "backstory": "Learned traditional medicine from their grandmother, combining herbs with modern medical knowledge." },
  { "skill": "medical", "backstory": "A psychology major who provides mental health support to trauma survivors." },
  { "skill": "medical", "backstory": "Former lab technician who can diagnose diseases and infections with limited equipment." },
  { "skill": "medical", "backstory": "Combat medic whose military training prepared them for treating severe injuries under fire." },
  { "skill": "medical", "backstory": "A former EMT who brings both medical skills and calm leadership to emergency situations." },
  { "skill": "medical", "backstory": "Former dental assistant who expanded their knowledge to general medical care out of necessity." },
  { "skill": "medical", "backstory": "A medical student when the world ended, whose incomplete training became complete through experience." },
  { "skill": "medical", "backstory": "Former hospital administrator who understands medical logistics and resource management." },
  { "skill": "medical", "backstory": "A massage therapist who learned anatomy thoroughly, applying that knowledge to injury treatment." },
  { "skill": "medical", "backstory": "Former research scientist who studied diseases and now works to prevent their spread." },
  { "skill": "medical", "backstory": "A midwife whose experience with birth and life transitions proves invaluable in a rebuilding world." },
  { "skill": "medical", "backstory": "Former medical equipment technician who can maintain and repair critical medical devices." },

  { "skill": "engineering", "backstory": "A former civil engineer who designs water systems and fortifications from salvaged materials." },
  { "skill": "engineering", "backstory": "Worked on power plants before the fall, now jury-rigs electrical systems to bring light to darkness." },
  { "skill": "engineering", "backstory": "Former automotive engineer who can keep vehicles running with minimal parts and maximum creativity." },
  { "skill": "engineering", "backstory": "A computer engineer who maintains communication networks and builds essential electronic systems." },
  { "skill": "engineering", "backstory": "Former mechanical engineer whose knowledge of physics and mechanics solves complex problems." },
  { "skill": "engineering", "backstory": "Worked in renewable energy, building wind and solar systems to provide sustainable power." },
  { "skill": "engineering", "backstory": "A chemical engineer who understands processes for creating fuel, medicines, and essential materials." },
  { "skill": "engineering", "backstory": "Former HVAC technician whose climate control knowledge keeps shelters livable." },
  { "skill": "engineering", "backstory": "Worked on water treatment plants, bringing clean water systems to contaminated wastelands." },
  { "skill": "engineering", "backstory": "A structural engineer who ensures buildings and bridges remain safe and functional." },
  { "skill": "engineering", "backstory": "Former telecommunications engineer who builds radio networks connecting scattered communities." },
  { "skill": "engineering", "backstory": "Worked in aerospace, applying precision engineering to create reliable mechanical systems." },
  { "skill": "engineering", "backstory": "A robotics engineer who builds automated systems to handle dangerous or repetitive tasks." },
  { "skill": "engineering", "backstory": "Former petroleum engineer who understands extraction and refinement of essential resources." },
  { "skill": "engineering", "backstory": "Worked in industrial design, creating efficient systems for manufacturing and production." },
  { "skill": "engineering", "backstory": "A biomedical engineer who combines engineering principles with medical device knowledge." },
  { "skill": "engineering", "backstory": "Former marine engineer who worked on ships, bringing maritime engineering to land-based projects." },
  { "skill": "engineering", "backstory": "Worked in nuclear power, understanding both the benefits and dangers of advanced energy systems." },
  { "skill": "engineering", "backstory": "A mining engineer who knows how to safely extract resources from dangerous underground locations." },
  { "skill": "engineering", "backstory": "Former quality control engineer who ensures all systems meet safety standards under harsh conditions." },

  { "skill": "combat", "backstory": "A former prison guard who learned to handle dangerous situations with minimal backup." },
  { "skill": "combat", "backstory": "Street fighter who earned respect through fists and determination in the urban ruins." },
  { "skill": "combat", "backstory": "Former competition shooter whose accuracy proves deadly when ammunition is scarce." },
  { "skill": "combat", "backstory": "Learned swordsmanship as a hobby, finding medieval skills surprisingly useful in modern wasteland." },
  { "skill": "combat", "backstory": "A former stuntwoman whose physical conditioning and risk assessment keep her alive in combat." },
  
  { "skill": "scavenging", "backstory": "Former estate sale coordinator who knows where people hide their most valuable possessions." },
  { "skill": "scavenging", "backstory": "Worked in shipping and receiving, understanding how goods move and where they get lost." },
  { "skill": "scavenging", "backstory": "A former crime scene investigator whose attention to detail reveals hidden caches and clues." },
  { "skill": "scavenging", "backstory": "Worked in inventory management, bringing systematic approaches to resource location and cataloging." },
  { "skill": "scavenging", "backstory": "Former customs inspector who developed skills at finding hidden contraband and secret compartments." },

  { "skill": "farming", "backstory": "A former chef who understands both growing ingredients and preparing them into nutritious meals." },
  { "skill": "farming", "backstory": "Worked at an agricultural research station, experimenting with crop varieties and growing techniques." },
  { "skill": "farming", "backstory": "Former county extension agent who taught farming techniques to small communities." },
  { "skill": "farming", "backstory": "A former florist who understands plant care and breeding for desired characteristics." },
  { "skill": "farming", "backstory": "Worked in a community garden program, teaching urban farming to city dwellers." },

  { "skill": "crafting", "backstory": "Former special effects artist who creates convincing replicas and repairs with limited materials." },
  { "skill": "crafting", "backstory": "A former military armorer who specializes in weapon maintenance and improvement." },
  { "skill": "crafting", "backstory": "Worked in a theatrical prop shop, creating functional items that look like something entirely different." },
  { "skill": "crafting", "backstory": "Former boat builder whose knowledge of weatherproofing and durability creates lasting constructions." },
  { "skill": "crafting", "backstory": "A former upholsterer who works with padding, fabric, and furniture construction." },

  { "skill": "medical", "backstory": "Former sports medicine specialist who understands injuries from physical stress and combat." },
  { "skill": "medical", "backstory": "A former medical examiner whose knowledge of anatomy proves surprisingly useful for treating the living." },
  { "skill": "medical", "backstory": "Worked in medical device testing, understanding how equipment functions and can be improvised." },
  { "skill": "medical", "backstory": "Former addiction counselor who helps survivors cope with trauma and substance dependencies." },
  { "skill": "medical", "backstory": "A former medical illustrator whose detailed anatomical knowledge aids in diagnosis and treatment." },

  { "skill": "engineering", "backstory": "Former video game programmer who approaches complex problems with systematic debugging skills." },
  { "skill": "engineering", "backstory": "A former facilities manager who understands building systems and infrastructure maintenance." },
  { "skill": "engineering", "backstory": "Worked in manufacturing quality assurance, ensuring systems function reliably under stress." },
  { "skill": "engineering", "backstory": "Former patent examiner who understands how thousands of different mechanical systems work." },
  { "skill": "engineering", "backstory": "A former technical writer who can document complex systems and train others in their use." },

  { "skill": "combat", "backstory": "Former riot police officer trained in crowd control and close-quarters combat situations." },
  { "skill": "combat", "backstory": "A wilderness survival instructor whose knife skills translate perfectly to combat scenarios." },
  { "skill": "combat", "backstory": "Former security chief at a high-tech facility, skilled in both tactics and hand-to-hand combat." },
  { "skill": "combat", "backstory": "A former fencing instructor whose blade work proves surprisingly effective against modern threats." },
  { "skill": "combat", "backstory": "Worked as a bodyguard for celebrities, combining combat skills with threat assessment." },
  
  { "skill": "scavenging", "backstory": "Former search and rescue specialist who can find anything in the most challenging terrain." },
  { "skill": "scavenging", "backstory": "A metal detector enthusiast who spent weekends finding lost treasures, now finding survival necessities." },
  { "skill": "scavenging", "backstory": "Former insurance investigator whose skills at finding hidden assets now locate hidden supplies." },
  { "skill": "scavenging", "backstory": "Worked in archaeological salvage, recovering valuable items from construction sites." },
  { "skill": "scavenging", "backstory": "A former private detective whose investigation skills reveal where others have hidden resources." },

  { "skill": "farming", "backstory": "Former livestock nutrition specialist who understands animal care and feed production." },
  { "skill": "farming", "backstory": "A former park ranger who managed wilderness preserves and understands ecosystem balance." },
  { "skill": "farming", "backstory": "Worked in organic certification, understanding sustainable growing practices and soil health." },
  { "skill": "farming", "backstory": "Former fish farm manager who brings aquaculture knowledge to food production." },
  { "skill": "farming", "backstory": "A former crop insurance adjuster who assessed agricultural success across diverse conditions." },

  { "skill": "crafting", "backstory": "Former museum restoration specialist who repairs and preserves valuable items with meticulous care." },
  { "skill": "crafting", "backstory": "A former automotive body shop owner who shapes metal and repairs damage to perfection." },
  { "skill": "crafting", "backstory": "Worked in prototype development, creating functional models from conceptual designs." },
  { "skill": "crafting", "backstory": "Former sailmaker whose fabric work creates durable tarps, bags, and weather protection." },
  { "skill": "crafting", "backstory": "A former instrument maker who creates precision tools and maintains delicate mechanisms." },

  { "skill": "medical", "backstory": "Former wildlife rehabilitation specialist who treats injuries and diseases in challenging conditions." },
  { "skill": "medical", "backstory": "A former medical missionary who provided healthcare in resource-limited environments." },
  { "skill": "medical", "backstory": "Worked in occupational health, understanding workplace injuries and preventive medicine." },
  { "skill": "medical", "backstory": "Former burn unit nurse who specializes in treating severe trauma and long-term recovery." },
  { "skill": "medical", "backstory": "A former medical supply distributor who knows where to find and how to use medical equipment." },

  { "skill": "engineering", "backstory": "Former brewery engineer who understands fermentation processes and chemical reactions." },
  { "skill": "engineering", "backstory": "A former elevator technician whose mechanical skills keep vertical transportation systems running." },
  { "skill": "engineering", "backstory": "Worked in waste management engineering, designing systems to handle and process refuse." },
  { "skill": "engineering", "backstory": "Former theme park engineer who designed complex mechanical attractions and safety systems." },
  { "skill": "engineering", "backstory": "A former shipyard engineer who built massive structures designed to withstand harsh environments." },

  { "skill": "combat", "backstory": "Former competitive archer whose precision and patience make them a deadly marksman." },
  { "skill": "combat", "backstory": "A former martial arts movie choreographer who combines flashy techniques with practical effectiveness." },
  { "skill": "scavenging", "backstory": "Former professional organizer who can efficiently sort through chaos to find valuable items." },
  { "skill": "scavenging", "backstory": "A former spelunker who explores caves and underground spaces others fear to enter." },
  { "skill": "farming", "backstory": "Former greenhouse manager who maximizes growing potential in controlled environments." },
  { "skill": "farming", "backstory": "A former worm farmer who understands composting and soil enrichment through biological processes." },
  { "skill": "crafting", "backstory": "Former 3D printing specialist who understands layer-by-layer construction and material properties." },
  { "skill": "crafting", "backstory": "A former toy designer who creates both functional and morale-boosting items for the community." },
  { "skill": "medical", "backstory": "Former flight nurse who provided medical care in moving vehicles under difficult conditions." },
  { "skill": "medical", "backstory": "A former pediatric nurse who understands the unique medical needs of children and families." },
  { "skill": "engineering", "backstory": "Former dam engineer who understands water management and large-scale structural projects." },
  { "skill": "engineering", "backstory": "A former subway system engineer who worked on underground transportation and infrastructure." },

  { "skill": "combat", "backstory": "Former medieval reenactor whose sword and shield techniques prove surprisingly effective." },
  { "skill": "combat", "backstory": "A former stunt double who combines physical conditioning with calculated risk-taking." },
  { "skill": "combat", "backstory": "Former animal control officer who knows how to handle dangerous creatures safely." },
  { "skill": "scavenging", "backstory": "A former beach comber who spent years finding treasures washed up by the sea." },
  { "skill": "scavenging", "backstory": "Former garage sale coordinator who has an eye for valuable items in piles of junk." },
  { "skill": "scavenging", "backstory": "A former repo agent who knows how to find hidden and valuable items quickly." },
  { "skill": "farming", "backstory": "Former wine maker who understands fermentation and the cultivation of specialized crops." },
  { "skill": "farming", "backstory": "A former honey producer who managed beehives and understood pollination ecosystems." },
  { "skill": "farming", "backstory": "Former Christmas tree farm manager who understood seasonal crop planning and tree cultivation." },
  { "skill": "crafting", "backstory": "A former sign maker who creates clear communication tools and navigation aids for the settlement." },
  { "skill": "crafting", "backstory": "Former cake decorator whose precision and artistic skills create both beautiful and functional items." },
  { "skill": "crafting", "backstory": "A former shoe cobbler who repairs and creates essential footwear from available materials." },
  { "skill": "medical", "backstory": "Former morgue technician whose knowledge of human anatomy aids in medical diagnosis." },
  { "skill": "medical", "backstory": "A former blood bank technician who understands transfusions and blood-related medical procedures." },
  { "skill": "medical", "backstory": "Former home health aide who provided medical care to patients in non-hospital environments." },
  { "skill": "engineering", "backstory": "A former traffic engineer who designed efficient movement systems and crowd flow management." },
  { "skill": "engineering", "backstory": "Former oil rig engineer who worked in harsh conditions maintaining complex mechanical systems." },
  { "skill": "engineering", "backstory": "A former sound engineer who understands acoustics and audio systems for communication networks." }
]